In [57]:
import pandas as pd
import requests

##Data Collection

In [58]:
url = "https://en.wikipedia.org/wiki/COVID-19_pandemic_by_country_and_territory"
req = requests.get(url)

data_list = pd.read_html(req.text)

In [59]:
target_df = data_list[2]
target_df

                                           Location[a]  ...                                               Ref.
                                    Unnamed: 0_level_1  ...                                                [4]
0                                                  NaN  ...                                               [17]
1                                                  NaN  ...                                               [18]
2                                                  NaN  ...                                           [19][20]
3                                                  NaN  ...                                           [21][22]
4                                                  NaN  ...                                               [26]
..                                                 ...  ...                                                ...
236                                                NaN  ...                                         [350][351]
237                                                NaN  ...                                              [352]
238                                                NaN  ...                                         [354][355]
239  As of 1 May 2021 (UTC) · History of cases · Hi...  ...  As of 1 May 2021 (UTC) · History of cases · Hi...
240  Notes.mw-parser-output .reflist{font-size:90%;...  ...  Notes.mw-parser-output .reflist{font-size:90%;...

[241 rows x 6 columns]

##Data Cleaning##

Column renaming

In [60]:
target_df.columns = ['Col0', 'Country Name', 'Total Cases', 'Total Deaths', 'Total Recoveries', 'Col5']

Deleting useless columns

In [61]:
target_df = target_df[['Country Name', 'Total Cases', 'Total Deaths', 'Total Recoveries']]

Deleting useless Rows

In [62]:
last_idx = target_df.index[-1]
target_df = target_df.drop([last_idx, last_idx-1])
target_df

                       Country Name Total Cases Total Deaths Total Recoveries
0                  United States[f]    32580305       582838          No data
1                             India    19164969       211853         15684406
2                            Brazil    14725975       406565         13242665
3                         France[g]     5642359       104706          No data
4                         Turkey[h]     4849408        40504          4405199
..                              ...         ...          ...              ...
234                  American Samoa           4            0                3
235                           Samoa           4            0                2
236                         Vanuatu           4            1                3
237  Federated States of Micronesia           1            0                1
238                    Tanzania[bd]     No data      No data          No data

[239 rows x 4 columns]

Inconsistent Country Names

In [63]:
target_df['Country Name'] = target_df['Country Name'].str.replace('\[.*\]','')

target_df

                       Country Name Total Cases Total Deaths Total Recoveries
0                     United States    32580305       582838          No data
1                             India    19164969       211853         15684406
2                            Brazil    14725975       406565         13242665
3                            France     5642359       104706          No data
4                            Turkey     4849408        40504          4405199
..                              ...         ...          ...              ...
234                  American Samoa           4            0                3
235                           Samoa           4            0                2
236                         Vanuatu           4            1                3
237  Federated States of Micronesia           1            0                1
238                        Tanzania     No data      No data          No data

[239 rows x 4 columns]

Extra Value in Column 4

In [64]:
target_df['Total Recoveries'] = target_df['Total Recoveries'].str.replace('No data','0')
target_df['Total Cases'] = target_df['Total Cases'].str.replace('No data','0')
target_df['Total Deaths'] = target_df['Total Deaths'].str.replace('No data','0')
target_df

                       Country Name Total Cases Total Deaths Total Recoveries
0                     United States    32580305       582838                0
1                             India    19164969       211853         15684406
2                            Brazil    14725975       406565         13242665
3                            France     5642359       104706                0
4                            Turkey     4849408        40504          4405199
..                              ...         ...          ...              ...
234                  American Samoa           4            0                3
235                           Samoa           4            0                2
236                         Vanuatu           4            1                3
237  Federated States of Micronesia           1            0                1
238                        Tanzania           0            0                0

[239 rows x 4 columns]

Wrong Data Type

In [68]:
target_df['Total Cases'] = pd.to_numeric(target_df['Total Cases'])
target_df['Total Deaths'][177] = "60"
target_df['Total Deaths'] = pd.to_numeric(target_df['Total Deaths'])
target_df['Total Recoveries'] = pd.to_numeric(target_df['Total Recoveries'])
target_df['Total Deaths']

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

0      582838
1      211853
2      406565
3      104706
4       40504
        ...
234         0
235         0
236         1
237         0
238         0
Name: Total Deaths, Length: 239, dtype: int64

##Export Dataset

In [69]:
target_df.to_csv(r'covid19_dataset.csv')